Repository: Kaedeeeeeeeeee/it_passport
Catalog: passnote_ios/passnote_ios/Localizable.xcstrings
Source language: ja
Languages: en, zh_hans

# sidebar.blog
source: ブログ
en: Blog
zh_hans: 博客

# sidebar.exam
source: 模擬試験
en: Mock exam
zh_hans: 模拟考试

# sidebar.examSub
source: Mock exam
en: 模擬試験

# sidebar.feedback
source: フィードバック
en: Feedback
zh_hans: 反馈

# sidebar.feedbackSubject
source: IT Passport - フィードバック
en: IT Passport - Feedback
zh_hans: IT Passport - 反馈

# sidebar.freeMember
source: 無料プラン
en: Free plan
zh_hans: 免费方案

# sidebar.home
source: ホーム
en: Home
zh_hans: 首页

# sidebar.library
source: 問題集
en: Library
zh_hans: 题库

# sidebar.librarySub
source: Library
en: 問題集

# sidebar.loginButton
source: ログイン
en: Log in
zh_hans: 登录

# sidebar.proMember
source: Pro メンバー
en: Pro member
zh_hans: Pro 会员

# sidebar.review
source: 復習
en: Review
zh_hans: 复习

# sidebar.reviewSub
source: Review
en: 復習

# sidebar.sourceBodyLine1
source: 独立行政法人
en: Information-technology Promotion

# sidebar.sourceBodyLine2
source: 情報処理推進機構 (IPA)
en: Agency, Japan (IPA)
zh_hans: 信息处理推进机构 (IPA)

# sidebar.sourceLabel
source: 出典
en: Source
zh_hans: 题源

# sidebar.sourceLink
source: 公式サイト →
en: Official site →
zh_hans: 官方网站 →

# sidebar.stats
source: 統計
en: Stats
zh_hans: 统计

# sidebar.statsSub
source: Stats
en: 統計

# stats.accuracyLabel
source: 正答率
en: Accuracy
zh_hans: 正确率

# stats.categoryAccuracyTitle
source: 分野別の正答率
en: Accuracy by category
zh_hans: 分领域正确率

# stats.categoryEmptyHint
source: データがありません。練習を始めると表示されます。
en: No data yet. Start practicing to see this.
zh_hans: 暂无数据。开始练习后会显示。

# stats.categoryEmptyLabel
source: 分野別
en: By category
zh_hans: 分领域

# stats.correctCount
source: 正解 {count} 回
en: {count} correct
zh_hans: 答对 {count} 次

# stats.examAccuracyTitle
source: 年度別の正答率
en: Accuracy by year
zh_hans: 按年份的正确率

# stats.examEmptyHint
source: 過去問モードで解答するとここに結果が並びます。
en: Take an exam in past mode to populate this.
zh_hans: 做了真题模式后这里会显示成绩。

# stats.examEmptyLabel
source: 年度別
en: By year
zh_hans: 按年份

# stats.examShortSeasonAutumn
source: 秋
en: A

# stats.examShortSeasonSpecial
source: 特
en: Sp

# stats.examShortSeasonSpring
source: 春
en: S

# stats.masteredCount
source: うち正解済 {count} 問
en: {count} mastered
zh_hans: 其中已掌握 {count} 题

# stats.needAttempts
source: 1 問以上解くと表示されます
en: Answer at least 1 question to see this
zh_hans: 做满一题后显示

# stats.noData
source: まだデータがありません
en: No data yet
zh_hans: 暂无数据

# stats.passingHigh
source: 合格ラインを超えています
en: Above the pass line
zh_hans: 已超过合格线

# stats.passingLow
source: まだ 60% 未満
en: Below 60%
zh_hans: 尚未达 60%

# stats.seenLabel
source: 学習した問題
en: Questions seen
zh_hans: 已学题数

# stats.streakLabel
source: 連続学習
en: Daily streak
zh_hans: 连续打卡

# stats.streakMany
source: 継続中
en: On a roll
zh_hans: 持续中

# stats.streakOne
source: 今日から始まりました
en: Day one!
zh_hans: 今天起航

# stats.streakSuffix
source: 日
en: days
zh_hans: 天

# stats.streakZero
source: 今日はまだです
en: Not yet today
zh_hans: 今天还没开始

# stats.subtitle
source: 学習の軌跡
en: Your learning trail
zh_hans: 学习轨迹

# stats.title
source: 統計
en: Stats
zh_hans: 统计

# stats.totalAttemptsLabel
source: 累計回答
en: Total attempts
zh_hans: 累计答题

# stats.trendLabel
source: 直近 30 日
en: Last 30 days
zh_hans: 近 30 天

# stats.trendSummary
source: {count} 回 / 30 日
en: {count} attempts / 30 days
zh_hans: {count} 次 / 30 天

# terms.body
source: ## 第1条（適用） 本規約は、張詩楓（以下「当方」といいます）が運営するウェブサービス「passnote.app（IT Passport 練習ノート）」（以下「本サービス」といいます）の利用条件を定めるものです。利用者の皆さま（以下「ユーザー」）には、本規約に同意のうえ本サービスをご利用いただきます。 ## 第2条（アカウント） 1. 本サービスの一部機能は、メールアドレスまたは Google アカウントによるサインインを必要とします。 2. ユーザーはアカウント情報の管理について自己の責任を負うものとし、第三者に利用させてはなりません。 3. ユーザーはいつでも自身でアカウントを削除できます。削除に伴うデータの取り扱いはプライバシーポリシーに従います。 ## 第3条（有料プランと支払い） 1. 本サービスには無料プランと Pro メンバーシップ（月額 ¥980）があります。 2. Pro メンバーシップの決済は Stripe を通じて行われます。 3. Pro メンバーシップ申込み時に 3 日間の無料トライアル期間が付与されます。トライアル期間中に解約すれば課金は発生しません。 4. トライアル期間終了後、解約手続きをしない限り月額料金が自動課金されます。以降の更新も同様です。 5. ユーザーはアカウントページからいつでも解約できます。**解約後の日割り返金は行いません**が、当該課金期間中は引き続き Pro 機能をご利用いただけます。 6. 価格・プラン内容は事前通知のうえ変更されることがあります。 ## 第4条（禁止事項） ユーザーは以下の行為をしてはなりません： - 法令または公序良俗に違反する行為 - 当方または第三者の知的財産権・プライバシー・肖像権その他の権利を侵害する行為 - 本サービスのコンテンツ（問題本文、AI 解説）を無断で複製・転載・配布する行為 - スクレイピング、自動化ツールでの大量アクセス、リバースエンジニアリング - 他のユーザーや第三者になりすます行為 - 本サービスの運営を妨害する行為 ## 第5条（知的財産権） 1. 本サービスのソースコード、デザイン、ロゴ、AI 解説等の著作権は当方または正当な権利者に帰属します。 2. 過去問本文の著作権は **独立行政法人 情報処理推進機構（IPA）** に帰属します。本サービスは IPA の利用条件の範囲内でこれを引用しています。 ## 第6条（免責事項） 1. 当方は、本サービスの内容（AI 解説の正確性を含む）について、いかなる保証も行いません。学習・試験対策の最終的な判断はユーザーの自己責任で行ってください。 2. 当方は、本サービスの中断、停止、利用不能、変更により生じたユーザーまたは第三者の損害について、当方に故意または重過失がある場合を除き、一切の責任を負いません。 3. 本サービスから第三者サービス（Stripe、Supabase、Google AI Gateway 等）へのリンク・連携については、当該第三者の規約・ポリシーが適用されます。 ## 第7条（サービスの変更・中断・終了） 当方は、ユーザーへの事前通知の有無にかかわらず、本サービスの内容を変更し、または提供を中断・終了することができます。 ## 第8条（規約の変更） 当方は本規約を随時変更できます。重要な変更がある場合は本サービス上で告知します。変更後に本サービスを利用したユーザーは、変更後の規約に同意したものとみなします。 ## 第9条（準拠法・管轄） 本規約は日本法に準拠します。本サービスに関する紛争については、当方の所在地を管轄する地方裁判所を第一審の専属的合意管轄裁判所とします。 ## 第10条（連絡先） お問い合わせは f.shera.09@gmail.com までご連絡ください。
en: ## 1. Scope These Terms govern your use of the website service "passnote.app (IT Passport Practice Notes)" (the "Service"), operated by Zhang Shifeng ("we", "us"). By using the Service you agree to these Terms. ## 2. Account 1. Some features require sign-in via email or Google account. 2. You are responsible for safeguarding your account credentials and may not share them with third parties. 3. You may delete your account at any time. Data handling on deletion is described in the Privacy Policy. ## 3. Paid plans and billing 1. The Service offers a free plan and a Pro membership (¥980/month). 2. Pro billing is processed by Stripe. 3. New Pro subscriptions include a 3-day free trial. Cancelling during the trial avoids any charge. 4. Unless cancelled, the subscription renews automatically each month after the trial. 5. You can cancel any time from the account page. **No prorated refund is given on cancellation**, but Pro access continues to the end of the current billing period. 6. Prices and plan contents may change with prior notice. ## 4. Prohibited conduct You must not: - Violate laws or public order - Infringe IP, privacy, or other rights of us or third parties - Reproduce, redistribute, or republish Service content (questions, AI explanations) without permission - Scrape, mass-access, or reverse-engineer the Service - Impersonate another user or third party - Disrupt the operation of the Service ## 5. Intellectual property 1. The Service's source code, design, logos, and AI explanations are owned by us or rightful holders. 2. The original past-exam content is copyright **Information-technology Promotion Agency, Japan (IPA)**, used by us within IPA's permitted scope. ## 6. Disclaimer 1. We make no warranty regarding the Service (including the accuracy of AI explanations). Final study and exam decisions are your own responsibility. 2. We are not liable for damages from interruption, change, or unavailability of the Service except in cases of our intent or gross negligence. 3. Third-party services we link or integrate with (Stripe, Supabase, Google AI Gateway, etc.) are governed by their own terms. ## 7. Service changes / termination We may change, suspend, or terminate the Service with or without prior notice. ## 8. Changes to these Terms We may revise these Terms at any time. Material changes will be announced on the Service. Continued use after changes constitutes acceptance. ## 9. Governing law and jurisdiction These Terms are governed by Japanese law. Disputes will be subject to the exclusive jurisdiction of the district court covering our principal place of business as the court of first instance. ## 10. Contact Reach us at f.shera.09@gmail.com.
zh_hans: ## 第 1 条（适用范围） 本协议规定了张诗枫（以下简称「我方」）运营的网络服务「passnote.app（IT Passport 练习笔记）」（以下简称「本服务」）的使用条件。用户在使用本服务时即视为同意本协议。 ## 第 2 条（账号） 1. 本服务部分功能需要通过邮箱或 Google 账号登录。 2. 用户应自行管理账号信息，不得允许第三方使用。 3. 用户可随时自行删除账号。删除后的数据处理详见隐私政策。 ## 第 3 条（付费方案与支付） 1. 本服务提供免费方案与 Pro 会员（月费 ¥980）。 2. Pro 会员的付款通过 Stripe 处理。 3. Pro 会员申请时附 3 天免费试用期。试用期内取消订阅不会产生费用。 4. 试用期结束后，若未取消则会自动按月续费。 5. 用户可通过账号页面随时取消订阅。**取消后不退还按日计算的费用**，但当前计费周期内仍可继续使用 Pro 功能。 6. 价格与方案内容可在事前通知后变更。 ## 第 4 条（禁止行为） 用户不得进行以下行为： - 违反法律或公序良俗 - 侵害我方或第三方的知识产权、隐私、肖像权等 - 未经许可复制、转载、传播本服务的内容（题目原文、AI 解析） - 爬取、自动化大量访问、逆向工程 - 假冒其他用户或第三方 - 妨碍本服务正常运营 ## 第 5 条（知识产权） 1. 本服务的源代码、设计、Logo、AI 解析等版权归属我方或合法权利人。 2. 历年真题原文版权归属 **独立行政法人 信息处理推进机构（IPA）**，本服务在 IPA 许可范围内引用。 ## 第 6 条（免责） 1. 我方对本服务内容（包括 AI 解析的准确性）不作任何保证。备考与判题的最终判断由用户自行负责。 2. 因本服务中断、变更、停止或不可用导致的损失，除我方有故意或重大过失外，我方不承担责任。 3. 本服务链接或集成的第三方服务（Stripe、Supabase、Google AI Gateway 等）适用其各自的协议与政策。 ## 第 7 条（服务变更与终止） 我方可在事先或事后通知的情况下变更、暂停或终止本服务。 ## 第 8 条（协议变更） 我方可随时修改本协议。重要变更将通过本服务公告。变更后继续使用本服务的用户视为同意新版协议。 ## 第 9 条（适用法律与管辖） 本协议适用日本法。与本服务有关的争议以我方所在地的地方法院为第一审专属合意管辖法院。 ## 第 10 条（联系方式） 请通过 f.shera.09@gmail.com 联系我们。

# terms.lastUpdated
source: 最終更新日：2026年4月26日
en: Last updated: 2026-04-26
zh_hans: 最后更新：2026-04-26

# terms.subtitle
source: passnote.app をご利用いただく前にお読みください
en: Please read before using passnote.app
zh_hans: 使用 passnote.app 前请阅读

# terms.title
source: 利用規約
en: Terms of Service
zh_hans: 用户协议

# tokushou.items.address
source: 所在地
en: Address

# tokushou.items.addressValue
source: 請求があれば遅滞なく開示します
en: Disclosed without delay upon request
zh_hans: 如有要求将立即披露

# tokushou.items.delivery
source: 商品引渡し時期
en: Delivery
zh_hans: 商品交付时期

# tokushou.items.deliveryValue
source: 決済完了後、即時に Pro 機能が利用可能になります
en: Pro features become available immediately after payment is confirmed
zh_hans: 支付完成后，立即可使用 Pro 功能

# tokushou.items.email
source: メールアドレス
en: Email
zh_hans: 邮箱

# tokushou.items.environment
source: 動作環境
en: System requirements
zh_hans: 运行环境

# tokushou.items.environmentValue
source: 最新版の Chrome / Safari / Firefox / Edge を推奨します
en: Latest versions of Chrome / Safari / Firefox / Edge are recommended
zh_hans: 建议使用最新版 Chrome / Safari / Firefox / Edge

# tokushou.items.extraFees
source: 商品代金以外の必要料金
en: Other required fees
zh_hans: 其他必要费用

# tokushou.items.extraFeesValue
source: 本サービスへのアクセスに伴う通信料はユーザー負担となります
en: Internet connection fees to access the Service are borne by the user
zh_hans: 访问本服务产生的网络通讯费由用户承担

# tokushou.items.paymentMethod
source: 支払方法
en: Payment method
zh_hans: 支付方式

# tokushou.items.paymentMethodValue
source: クレジットカード決済（Stripe を通じて処理）
en: Credit card (processed via Stripe)
zh_hans: 信用卡支付（通过 Stripe 处理）

# tokushou.items.paymentTiming
source: 支払時期
en: Billing timing
zh_hans: 支付时期

# tokushou.items.paymentTimingValue
source: お申込み時に課金、以降毎月同日に自動更新
en: Charged on subscription, then automatically renewed on the same day each month
zh_hans: 申请时即时收费，之后每月同日自动续费

# tokushou.items.phone
source: 電話番号
en: Phone
zh_hans: 电话

# tokushou.items.phoneValue
source: 請求があれば遅滞なく開示します
en: Disclosed without delay upon request
zh_hans: 如有要求将立即披露

# tokushou.items.price
source: 商品代金
en: Price
zh_hans: 商品价格

# tokushou.items.priceValue
source: Pro メンバーシップ：月額 ¥980
en: Pro membership: ¥980 / month
zh_hans: Pro 会员：月费 ¥980

# tokushou.items.returns
source: 返品・キャンセル
en: Refunds / cancellation
zh_hans: 退款 / 取消

# tokushou.items.returnsValue
source: デジタルサービスの性質上、決済後の返金は原則行いません。サブスクリプションはアカウントページからいつでも解約でき、解約後も当該課金期間の終了まで Pro 機能をご利用いただけます。3 日間の無料トライアル期間中に解約すれば課金は発生しません。
en: Due to the nature of digital services, refunds are not provided in principle. You can cancel from the account page at any time; Pro features remain available through the end of the current billing period after cancellation. Cancelling within the 3-day free trial avoids any charge.
zh_hans: 由于数字服务的特殊性，原则上不退款。订阅可在账号页面随时取消，取消后到当期账期结束为止仍可使用 Pro 功能。3 天免费试用期内取消则不会产生费用。

# tokushou.items.seller
source: 販売事業者
en: Seller
zh_hans: 销售事业者

# tokushou.items.sellerValue
source: 張詩楓
en: Zhang Shifeng
zh_hans: 张诗枫

# tokushou.items.service
source: サービス名
en: Service name
zh_hans: 服务名

# tokushou.items.serviceValue
source: passnote.app（IT Passport 練習ノート）
en: passnote.app (IT Passport Practice Notes)
zh_hans: passnote.app（IT Passport 练习笔记）

# tokushou.lastUpdated
source: 最終更新日：2026年4月26日
en: Last updated: 2026-04-26
zh_hans: 最后更新：2026-04-26

# tokushou.subtitle
source: Pro メンバーシップの販売条件
en: Required disclosure under Japan's Specified Commercial Transaction Act
zh_hans: Pro 会员的销售条件（日本法律披露）

# tokushou.title
source: 特定商取引法に基づく表記
en: Commercial transaction disclosure
zh_hans: 特定商交易法表记

# progress.seenSuffix
source: 問
zh_hans: 题

# stats.seenSuffix
source: 問
zh_hans: 题

# stats.totalAttemptsSuffix
source: 回
zh_hans: 次
